[
  {
    "id": 1,
    "id_modulo": 1,
    "imagen_portada": "aws-blanco",
    "titulo": "Configuración de puertos en instancia de AWS",
    "descripcion": "configuración correcta de los puertos para exponer tu base de datos en AWS de forma segura.",
    "video_url": "https://ameth-toledo.github.io/recursos/videos/video1.mp4",
    "descripcion_module": "Hola! te saluda Ameth Toledo, espero que este curso sea de tu agrado. Aquí aprenderás a cómo configurar correctamente los puertos en tu instancia de AWS para exponer servicios de manera segura.",
    "repositorio": "https://github.com/Ameth-Toledo/Front_Free.git"
  },
  {
    "id": 2,
    "id_modulo": 2,
    "imagen_portada": "aws-blanco",
    "titulo": "Instalación de MySQL",
    "descripcion": "Instalación de dependencias necesarias para correr la base de datos.",
    "video_url": "https://ameth-toledo.github.io/recursos/videos/videoprueba2.mp4",
    "descripcion_module": "Hola! te saluda Ameth Toledo, espero que este curso sea de tu agrado. Aquí aprenderás a cómo instalar MySQL y sus dependencias para que puedas correr tu base de datos sin problemas.",
    "repositorio": ""
  },
  {
    "id": 3,
    "id_modulo": 3,
    "imagen_portada": "aws-blanco",
    "titulo": "Configuración de MySQL para Acceso Remoto",
    "descripcion": "Configuración de acceso remoto para permitir todas las conexiones remotas.",
    "video_url": "",
    "descripcion_module": "Hola! te saluda Ameth Toledo, espero que este curso sea de tu agrado. Aquí aprenderás a cómo habilitar el acceso remoto a tu base de datos MySQL desde cualquier parte.",
    "repositorio": ""
  },
  {
    "id": 4,
    "id_modulo": 4,
    "imagen_portada": "aws-blanco",
    "titulo": "Conexión con workbech por medio de IP",
    "descripcion": "Configuración de acceso remoto para permitir todas las conexiones remotas.",
    "video_url": "",
    "descripcion_module": "Hola! te saluda Ameth Toledo, espero que este curso sea de tu agrado. Aquí aprenderás a cómo conectarte a tu base de datos usando Workbench a través de la IP pública.",
    "repositorio": ""
  },
  {
    "id": 5,
    "id_modulo": 5,
    "imagen_portada": "nodejs",
    "titulo": "Configuración de CORS para API REST",
    "descripcion": "Cómo configurar CORS correctamente en tu API desplegada en AWS.",
    "video_url": "",
    "descripcion_module": "Hola! te saluda Ameth Toledo, espero que este curso sea de tu agrado. Aquí aprenderás a cómo configurar correctamente CORS en tu API REST para que funcione sin errores desde cualquier frontend.",
    "repositorio": ""
  }
]
